In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("Sample100.csv")

In [3]:
df

,Serial Number,Company Name,Employee Markme,Description,Leave
0,9788189999599,TALES OF SHIVA,Mark,mark,0
1,9780099578079,1Q84 THE COMPLETE TRILOGY,HARUKI MURAKAMI,Mark,0
2,9780198082897,MY KUMAN,Mark,Mark,0
3,9780007880331,THE GOD OF SMAAL THINGS,ARUNDHATI ROY,4TH HARPER COLLINS,2
4,9780545060455,THE BLACK CIRCLE,Mark,4TH HARPER COLLINS,0
...,...,...,...,...,...
94,9788184821536,MORE STORIES FROM THE JATAKAS,Mark,ACK,0
95,9788184821543,MORE TALES OF BIRBAL,-,ACK,0
96,9788184821550,TALES FROM THE JATAKAS,-,ACK,0
97,9788184821567,RAMarkS OF MEWAR,-,ACK,0
98,9788184821574,THE SONS OF THE PANDAVAS,-,ACK,0

In [4]:
df.columns

Index(['Serial Number', 'Company Name', 'Employee Markme', 'Description',
       'Leave'],
      dtype='object')

In [5]:
df[['Serial Number']][0:5]

   Serial Number
0  9788189999599
1  9780099578079
2  9780198082897
3  9780007880331
4  9780545060455

In [6]:
df.dtypes

Serial Number       int64
Company Name       object
Employee Markme    object
Description        object
Leave               int64
dtype: object

In [7]:
df.dtypes[df.dtypes == 'object']

Company Name       object
Employee Markme    object
Description        object
dtype: object

In [8]:
[df.dtypes[df.dtypes == 'object'].index]

[Index(['Company Name', 'Employee Markme', 'Description'], dtype='object')]

In [9]:
df[df.dtypes[df.dtypes == 'object'].index]

                     Company Name  Employee Markme         Description
0                  TALES OF SHIVA             Mark                mark
1       1Q84 THE COMPLETE TRILOGY  HARUKI MURAKAMI                Mark
2                        MY KUMAN             Mark                Mark
3         THE GOD OF SMAAL THINGS    ARUNDHATI ROY  4TH HARPER COLLINS
4                THE BLACK CIRCLE             Mark  4TH HARPER COLLINS
..                            ...              ...                 ...
94  MORE STORIES FROM THE JATAKAS             Mark                 ACK
95           MORE TALES OF BIRBAL                -                 ACK
96         TALES FROM THE JATAKAS                -                 ACK
97               RAMarkS OF MEWAR                -                 ACK
98       THE SONS OF THE PANDAVAS                -                 ACK

[99 rows x 3 columns]

In [10]:
df[df.dtypes[df.dtypes == 'int64'].index]

    Serial Number  Leave
0   9788189999599      0
1   9780099578079      0
2   9780198082897      0
3   9780007880331      2
4   9780545060455      0
..            ...    ...
94  9788184821536      0
95  9788184821543      0
96  9788184821550      0
97  9788184821567      0
98  9788184821574      0

[99 rows x 2 columns]

In [11]:
df

,Serial Number,Company Name,Employee Markme,Description,Leave
0,9788189999599,TALES OF SHIVA,Mark,mark,0
1,9780099578079,1Q84 THE COMPLETE TRILOGY,HARUKI MURAKAMI,Mark,0
2,9780198082897,MY KUMAN,Mark,Mark,0
3,9780007880331,THE GOD OF SMAAL THINGS,ARUNDHATI ROY,4TH HARPER COLLINS,2
4,9780545060455,THE BLACK CIRCLE,Mark,4TH HARPER COLLINS,0
...,...,...,...,...,...
94,9788184821536,MORE STORIES FROM THE JATAKAS,Mark,ACK,0
95,9788184821543,MORE TALES OF BIRBAL,-,ACK,0
96,9788184821550,TALES FROM THE JATAKAS,-,ACK,0
97,9788184821567,RAMarkS OF MEWAR,-,ACK,0
98,9788184821574,THE SONS OF THE PANDAVAS,-,ACK,0

In [12]:
df.loc[0:1,['Serial Number','Company Name']]

   Serial Number               Company Name
0  9788189999599             TALES OF SHIVA
1  9780099578079  1Q84 THE COMPLETE TRILOGY

In [13]:
df.iloc[0:1,[0,1]]

   Serial Number    Company Name
0  9788189999599  TALES OF SHIVA

# Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [14]:
actor = pd.Series(['Ajay Devgan','Salman Khan','Sharukh Khan','Allu Arjum'])
charges = pd.Series(['1 Cr.', '5 Cr.', '4.5 Cr.','3 Cr.'])
movie = pd.Series(['Singham','Tiger','Pathan','DJ'])

frame = {'A':actor,'B':charges, 'C':movie}
mydata =pd.DataFrame(frame)

In [15]:
new_index =[1,2,4]
mydata.reindex(new_index)

              A        B       C
1   Salman Khan    5 Cr.   Tiger
2  Sharukh Khan  4.5 Cr.  Pathan
4           NaN      NaN     NaN

# Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The function should print the sum to the console. For example, if the 'Values' column of df contains the values [10, 20, 30, 40, 50], your function should calculate and print the sum of the first three values, which is 60.

In [16]:
a = {'Values':[10,20,30,40,50]}

In [17]:
df1 = pd.DataFrame(a)

In [18]:
df1

   Values
0      10
1      20
2      30
3      40
4      50

In [19]:
df1.dtypes

Values    int64
dtype: object

In [20]:
def Sum_of_three(df1):
    total = 0
    for i , row in df1.iterrows():
        if i < 3:
            total += row['Values']
    print("The sum of Three Values is : ",total)

In [21]:
Sum_of_three(df1)

The sum of Three Values is :  60

# Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column 'Word_Count' that contains the number of words in each row of the 'Text' column.

In [22]:
dfram = pd.DataFrame({'Text':['Hello This is my Text','How Are You','I Hope You Are Doing Well','The Day Is Vary Hot']})

In [23]:
dfram

                        Text
0      Hello This is my Text
1                How Are You
2  I Hope You Are Doing Well
3        The Day Is Vary Hot

In [24]:
def count_words(df):
        df['Word_Count'] = df['Text'].apply(lambda x: len(str(x).split(" ")))
        return df
    
    
    
    
df = count_words(dfram)
print(df)

                        Text  Word_Count
0      Hello This is my Text           5
1                How Are You           3
2  I Hope You Are Doing Well           6
3        The Day Is Vary Hot           5

# Q5. How are DataFrame.size() and DataFrame.shape() different?

In [25]:
df =pd.read_csv("nba.csv")

In [26]:
df

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0
...,...,...,...,...,...,...,...,...,...
453,Shelvin Mack,Utah Jazz,8.0,PG,26.0,6-3,203.0,Butler,2433333.0
454,Raul Neto,Utah Jazz,25.0,PG,24.0,6-1,179.0,NaN,900000.0
455,Tibor Pleiss,Utah Jazz,21.0,C,26.0,7-3,256.0,NaN,2900000.0
456,Jeff Withey,Utah Jazz,24.0,C,26.0,7-0,231.0,Kansas,947276.0
457,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [27]:
# Returns size of dataframe/series which is equivalent to total number of elements. That is rows x columns.


df.size

4122

In [28]:
# Returns tuple of shape (Rows, columns) of dataframe/series

df.shape

(458, 9)

In [29]:
# Returns dimension of dataframe/series. 1 for one dimension (series), 2 for two dimension (dataframe)

df.ndim

2

# Q6. Which function of pandas do we use to read an excel file?

In [30]:
pd.read_excel("sample-xls-file-for-testing.xls").head()

,Segment,Country,Product,Discount Band,Units Sold,Manufacturing Price,Sale Price,Gross Sales,Discounts,Sales,COGS,Profit,Date,Month Number,Month Name,Year
0,Government,Canada,Carretera,None,1618.5,3,20,32370.0,0.0,32370.0,16185.0,16185.0,2014-01-01,1,January,2014
1,Government,Germany,Carretera,None,1321.0,3,20,26420.0,0.0,26420.0,13210.0,13210.0,2014-01-01,1,January,2014
2,Midmarket,France,Carretera,None,2178.0,3,15,32670.0,0.0,32670.0,21780.0,10890.0,2014-06-01,6,June,2014
3,Midmarket,Germany,Carretera,None,888.0,3,15,13320.0,0.0,13320.0,8880.0,4440.0,2014-06-01,6,June,2014
4,Midmarket,Mexico,Carretera,None,2470.0,3,15,37050.0,0.0,37050.0,24700.0,12350.0,2014-06-01,6,June,2014

# Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email addresses in the format 'username@domain.com'. Write a Python function that creates a new column 'Username' in df that contains only the username part of each email address.

In [31]:
df = pd.DataFrame({'Email':['username@domain.com','jamesharis@gmail.com','Mrwick@gmail.com']})

In [32]:
df

                  Email
0   username@domain.com
1  jamesharis@gmail.com
2      Mrwick@gmail.com

In [33]:
df

                  Email
0   username@domain.com
1  jamesharis@gmail.com
2      Mrwick@gmail.com

In [52]:
def New_column(df):
    # Split the 'Email' column into two parts: the username and the domain
    df[['Username','Domain']] = df['Email'].str.split('@',expand = True)

    # Return the updated DataFrame
    return df

In [56]:
df = New_column(df)

In [57]:
df

                  Email    Username      Domain
0   username@domain.com    username  domain.com
1  jamesharis@gmail.com  jamesharis   gmail.com
2      Mrwick@gmail.com      Mrwick   gmail.com

# Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selectsall rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The function should return a new DataFrame that contains only the selected rows. For example, if df contains the following values:

In [122]:
data = {
    'A': [3, 8, 6, 2, 9],
    'B': [5, 2, 9, 3, 1],
    'C': [1, 7, 4, 5, 2]
        }

In [123]:
df = pd.DataFrame(data)

In [124]:
df

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [125]:
df.columns

Index(['A', 'B', 'C'], dtype='object')

In [126]:
def Check(df):
    
    new = df[(df['A']>5) & (df['B'] < 10)]
    return new

In [127]:
Check(df)

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

# Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean, median, and standard deviation of the values in the 'Values' column.

In [146]:
def Calculate(df):
    
    mean = df['Values'].mean()
    median= df['Values'].median()
    standd = df['Values'].std()
    print("Mean of Column 'Values:'",mean)
    print("The Median of Coumn 'Values':",median)
    print("The Standard Derivation of Column 'Values:'",standd)

In [147]:
df = pd.DataFrame({'Values':[10,20,30,40,50,60,70,80,90,100]})

In [148]:
Calculate(df)

Mean of Column 'Values:' 55.0
The Median of Coumn 'Values': 55.0
The Standard Derivation of Column 'Values:' 30.276503540974915

# Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days for each row in the DataFrame. The moving average should be calculated using a window of size 7 and should include the current day.

In [177]:
df= pd.DataFrame({
                    'Sales':[2000,5000,4000,3400,5450,5655,4500,7800],
                     'Date':pd.date_range(start='2023-01-01',periods=len(df['Sales']))
                 })

In [180]:
df

   Sales       Date
0   2000 2023-01-01
1   5000 2023-01-02
2   4000 2023-01-03
3   3400 2023-01-04
4   5450 2023-01-05
5   5655 2023-01-06
6   4500 2023-01-07
7   7800 2023-01-08

In [181]:
def Moving_average(df):
    
    df['Moving Average'] = df['Sales'].rolling(window=7, min_periods=1).mean()
    return df

In [182]:
Moving_average(df)

   Sales       Date  Moving Average
0   2000 2023-01-01     2000.000000
1   5000 2023-01-02     3500.000000
2   4000 2023-01-03     3666.666667
3   3400 2023-01-04     3600.000000
4   5450 2023-01-05     3970.000000
5   5655 2023-01-06     4250.833333
6   4500 2023-01-07     4286.428571
7   7800 2023-01-08     5115.000000

# Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g. Monday, Tuesday) corresponding to each date in the 'Date' column.

For example, if df contains the following values:
Date
0 2023-01-01
1 2023-01-02
2 2023-01-03
3 2023-01-04
4 2023-01-05

Your function should create the following DataFrame:

Date Weekday
0 2023-01-01 Sunday
1 2023-01-02 Monday
2 2023-01-03 Tuesday
3 2023-01-04 Wednesday
4 2023-01-05 Thursday
The function should return the modified DataFrame.

In [266]:
# def add_weekday(df):
#     df['Week-day'] = df['Date'].dt.strftime('%A')
#     return df


# df = pd.DataFrame({'Date': ['2023-01-01', '2023-01-02', '2023-01-03', '2023-01-04', '2023-01-05']})
# df['Date'] = pd.to_datetime(df['Date'])
# df = add_weekday(df)
# print(df)

In [301]:
df = pd.DataFrame({'Date': ['2023-01-01', '2023-01-02', '2023-01-03', '2023-01-04', '2023-01-05']})

In [302]:
df

         Date
0  2023-01-01
1  2023-01-02
2  2023-01-03
3  2023-01-04
4  2023-01-05

In [306]:
def WeekName(df):
    df['Date'] = pd.to_datetime(df.Date)
    df['WeekDays'] = pd.DatetimeIndex(df.Date).day_name()
    return df

In [307]:

WeekName(df)

        Date   WeekDays
0 2023-01-01     Sunday
1 2023-01-02     Monday
2 2023-01-03    Tuesday
3 2023-01-04  Wednesday
4 2023-01-05   Thursday

# Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [359]:
def Select_row(df):
    df['Date'] = pd.to_datetime(df['Date'])
    Rnge = df[df['Date'].between('2023-01-01','2023-01-31')]
    return Rnge

In [360]:
df = pd.DataFrame({'Date':['2023-01-01', 
'2023-01-02',
'2023-01-03', 
'2023-01-04', 
'2023-01-05', 
'2023-02-06', 
'2023-02-07', 
'2023-03-08', 
'2023-04-09', 
'2023-05-10', 
'2023-01-06', 
'2023-01-08']})

In [361]:
Select_row(df)

         Date
0  2023-01-01
1  2023-01-02
2  2023-01-03
3  2023-01-04
4  2023-01-05
10 2023-01-06
11 2023-01-08

# Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to be imported?

In [ ]:
import pandas as pd    ## pd is use as alias we use any name intead of this........